<?php
if (date('d.m.Y', $first_str + $i*24*60*60) == $special_days[0]) { ?>
<table>
	<tr class="table-header table-row">
		<th class="subject-time-td"><img alt="Время" src="data:image/svg+xml;charset=utf-8,%0D%0A%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20xmlns%3Axlink%3D%22http%3A%2F%2Fwww.w3.org%2F1999%2Fxlink%22%20version%3D%221.1%22%20x%3D%220px%22%20y%3D%220px%22%20viewBox%3D%220%200%2041.301%2041.301%22%20style%3D%22enable-background%3Anew%200%200%2041.301%2041.301%3B%22%20xml%3Aspace%3D%22preserve%22%20width%3D%22512px%22%20height%3D%22512px%22%20class%3D%22%22%3E%3Cg%3E%3Cpath%20d%3D%22M20.642%2C0c5.698%2C0%2C10.857%2C2.317%2C14.602%2C6.047c3.73%2C3.746%2C6.047%2C8.905%2C6.047%2C14.603%20%20c0%2C5.698-2.317%2C10.857-6.047%2C14.603c-3.746%2C3.73-8.904%2C6.047-14.602%2C6.047S9.786%2C38.983%2C6.056%2C35.253%20%20C2.31%2C31.507%2C0.008%2C26.349%2C0.008%2C20.65c0-5.698%2C2.301-10.857%2C6.047-14.603C9.786%2C2.317%2C14.944%2C0%2C20.642%2C0L20.642%2C0z%20M31.166%2C19.523%20%20c0.619%2C0%2C1.111%2C0.508%2C1.111%2C1.127c0%2C0.619-0.492%2C1.127-1.111%2C1.127H20.674h-0.032c-0.413%2C0-0.778-0.238-0.968-0.571l-0.016-0.016%20%20l0%2C0l-0.016-0.032l0%2C0v-0.016l0%2C0l-0.016-0.032l0%2C0l-0.016-0.032l0%2C0v-0.016l0%2C0l-0.016-0.032l0%2C0l-0.016-0.016l0%2C0v-0.032l0%2C0%20%20l-0.016-0.032l0%2C0v-0.016l0%2C0l-0.016-0.032l0%2C0v-0.032l0%2C0v-0.016v-0.016l-0.016-0.016l0%2C0v-0.032l0%2C0v-0.032l0%2C0V20.73l0%2C0v-0.016%20%20l0%2C0v-0.032l0%2C0V20.65l0%2C0V7.206c0-0.619%2C0.492-1.111%2C1.111-1.111c0.619%2C0%2C1.127%2C0.492%2C1.127%2C1.111v12.317H31.166z%20M33.657%2C7.635%20%20c-3.333-3.333-7.936-5.381-13.015-5.381S10.96%2C4.301%2C7.627%2C7.635C4.31%2C10.968%2C2.246%2C15.571%2C2.246%2C20.65%20%20c0%2C5.079%2C2.063%2C9.682%2C5.381%2C13.016c3.333%2C3.333%2C7.936%2C5.381%2C13.015%2C5.381s9.682-2.048%2C13.015-5.381%20%20c3.333-3.333%2C5.397-7.936%2C5.397-13.016C39.054%2C15.571%2C36.991%2C10.968%2C33.657%2C7.635L33.657%2C7.635z%22%20fill%3D%22%23FFFFFF%22%2F%3E%3C%2Fg%3E%3C%2Fsvg%3E%0D%0A"></th>
		<th class="subject-aud-td"><img alt="Аудитория" src="data:image/svg+xml;charset=utf-8,%0D%0A%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20xmlns%3Axlink%3D%22http%3A%2F%2Fwww.w3.org%2F1999%2Fxlink%22%20version%3D%221.1%22%20x%3D%220px%22%20y%3D%220px%22%20width%3D%22512px%22%20height%3D%22512px%22%20viewBox%3D%220%200%20492.5%20492.5%22%20style%3D%22enable-background%3Anew%200%200%20492.5%20492.5%3B%22%20xml%3Aspace%3D%22preserve%22%3E%3Cg%3E%3Cg%3E%0D%0A%09%3Cpath%20d%3D%22M184.646%2C0v21.72H99.704v433.358h31.403V53.123h53.539V492.5l208.15-37.422v-61.235V37.5L184.646%2C0z%20M222.938%2C263.129%20%20%20c-6.997%2C0-12.67-7.381-12.67-16.486c0-9.104%2C5.673-16.485%2C12.67-16.485s12.67%2C7.381%2C12.67%2C16.485%20%20%20C235.608%2C255.748%2C229.935%2C263.129%2C222.938%2C263.129z%22%20fill%3D%22%23FFFFFF%22%2F%3E%0D%0A%3C%2Fg%3E%3C%2Fg%3E%0D%0A%3C%2Fsvg%3E%0D%0A"></th>
		<th class="subject-name-td">Предмет</th>
		<th class="subject-data-td"></th>
	</tr>
	<tr lesson="0" class="table-row">
		<th>9:00-9:35</th>
		<th></th>
		<th class="th-subject-name">Линейка</th>
		<th></th>
	</tr>
	<tr lesson="1" class="table-row">
		<th>9:45-11:20</th>
		<th></th>
		<th class="th-subject-name">Система высшего образования в РФ. Структура университета, факультета. Технология учебной работы студента вуза</th>
		<th></th>
	</tr>
	<tr lesson="2" class="table-row no-border-bottom">
		<th>11:30-14:50</th>
		<th>1-409</th>
		<th class="th-subject-name">Ознакомление с положениями, регулирующими учебно-организационные отношения в университете, и правилами внутреннего распорядка, встреча с преподавателями, вручение студенческих билетов</th>
		<th></th>
	</tr>
</table>
	<?php
}
?>