<?php
// $arr = ['response'=>
// 	[
// 		'days'=>[
// 			0=>[1.2,3],
// 			3=>[]
// 		]
// 	]
// ];
// // $arr = [
// // 	'response'=>[['математика', 'русский', 'география', 'биология', 'физра', 'физра'],['математика', 'русский', 'география', 'биология', 'физра', 'физра'],['математика', 'русский', 'география', 'биология', 'физра', 'физра'],['математика', 'русский', 'география', 'биология', 'физра', 'физра'],['математика', 'русский', 'география', 'биология', 'физра', 'физра'],['математика', 'русский', 'география', 'биология', 'физра', 'физра']]
// // ];
// echo json_encode($arr);
echo str_replace('+', '%20', urlencode('
<svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" version="1.1" x="0px" y="0px" viewBox="0 0 426.667 426.667" xml:space="preserve">
<path style="fill:#6AC259;" d="M213.333,0C95.518,0,0,95.514,0,213.333s95.518,213.333,213.333,213.333  c117.828,0,213.333-95.514,213.333-213.333S331.157,0,213.333,0z M174.199,322.918l-93.935-93.931l31.309-31.309l62.626,62.622  l140.894-140.898l31.309,31.309L174.199,322.918z"></path>
</svg>
'));
// $arr = [
// 	'subjects'=>[
// 		'математический анализ',
// 		'программирование',
// 		'алгебра и аналитическая геометрия',
// 		'история',
// 		'русский язык',
// 		'информатика',
// 		'библиотечные занятия',
// 		'социально-психологическая адаптация',
// 		'иностранный язык',
// 		'дискретная математика',
// 		'философия',
// 		'физические основы элементной базы компьютерной техники',
// 		'правоведение',
// 		'действительный и комплексный анализ',
// 		'физика',
// 		'математическая логика',
// 		'дополнительные главы алгебры и геометрии',
// 		'компьютерная графика',
// 		'физическая культура и спорт',
// 		'---',
// 		'удалить'
// 	]
// ];
// echo json_encode($arr);
?>